import './App.css';
import React, { useEffect, useState } from "react";

import { Space, Table, Tag } from 'antd';
import { parse } from 'marked';

const columns = [
  {
    title: '营业执照',
    dataIndex: 'name',
    key: 'name',
    render: text => <a>{text}</a>,
  },
  {
    title: '银行卡号',
    dataIndex: 'age',
    key: 'age',
  },
  {
    title: '地址',
    dataIndex: 'address',
    key: 'address',
  },
  {
    title: '客户名称',
    key: 'tags',
    dataIndex: 'tags',
    render: (_, { tags }) => (
      <>
        {tags.map(tag => {
          let color = tag.length > 5 ? 'geekblue' : 'green';
          if (tag === 'loser') {
            color = 'volcano';
          }
          return (
            <Tag color={color} key={tag}>
              {tag.toUpperCase()}
            </Tag>
          );
        })}
      </>
    ),
  },
  {
    title: 'Action',
    key: 'action',
    render: (_, record) => (
      <Space size="middle">
        <a>Invite {record.name}</a>
        <a>Delete</a>
      </Space>
    ),
  },
];

const data = [
  {
    key: '1',
    name: '510030200123456124117004186056214',
    age: '137691748506217003860010905220',
    address: 'New York No. 1 Lake Park',
    tags: ['陈盼', '李登权'],
  },
  {
    key: '2',
    name: '510030200123456124117004186056214',
    age: '137197700716212263602118776830',
    address: 'London No. 1 Lake Park',
    tags: ['李小姐'],
  },
  {
    key: '3',
    name: 'Joe Black',
    age: 32,
    address: 'Sidney No. 1 Lake Park',
    tags: ['cool', 'teacher'],
  },
];

const styles = {
  img: {
    width: '280px'
  },
  title: {
    fontSize: '16px',
    fontWeight: 700,
    color: 'rgba(1,20,58,0.9000)',
    paddingTop: '24px',
  },
  tip: {
    fontSize: '12px',
    fontWeight: 400,
    color: 'rgba(1,20,58,0.3000)',
    paddingTop: '8px',
  },
  btn: {
    marginTop: '24px',
  }
}

function App() {
  const [newdata, setData] = useState([]);
  useEffect(() => {
    setTimeout(() => {
      setData(data)
    }, 10000)
  }, [])
  const createMarkup = () => {
    return {__html: parse(`

    李淑芬 410102199003071310、

河北省安阳市金山屯区宝山路32号真新六街坊、

021-6258000、
吴威德 350781196403077349、

广东省安顺市南岔区安远路195号爱里舍花园、
0551-4422984王圣义、
350781196403077445、

贵州省安顺市平坝区贵发小区公共服务站、

0552-6026886黄娇旭、
110101200203074186、

广东省汕尾市海丰县海城镇新园5巷177号 、

0939-8718333朱宜欣、

110101200203077408、
湖北省武汉市洪山区和平街道徐东二路欧洲花园、

陈振江、
110101200203077782、
浙江省 杭州市 体育场路238号郭智强、
150102199003074315、

杭州市下城区华中路附近、
0755-83938000许翰芸、

410102199003070975、
浙江省金华市东阳市江北街道北鹿西街750号钱雯升、

41010219900307081X、
浙江省温州市江滨西路深发商住楼1幢201室陈柏德、

110101200203073845、

广东省深圳市宝安区留仙一路高新奇二期1号楼3B09谢文祥、
410102199003079216、

江苏省无锡市新吴区香山名园8-603陈婉君、

150102199003074331、

江西省上饶市广丰区丰溪街道南屏路水南超市后面快递站林玉桦、
110101200203073087、

广东省潮州市潮安县江东镇圆通快递站点隆馨妤、

150102199003075553、
河北省邢台市柏乡县王家庄乡路口馒头房对面刘伦齐、
150102199003077436、山东省青岛市李沧区永清路51号菜鸟驿站张珊郁、
150102199003076054、

湖北省武汉市洪山区和平街道徐东大街欧洲花园11栋王妙睿、
350781196403079045、
山东省青岛市李沧区升平新城泮珍候文杰党天龙官礼金强治民彭水玉令狐绍辉高小岗李谦挣向江林261 10不对 姓名96%15位身份证

 511702800222130 

qq邮箱：

wanggl_878420@foxmail.com 

网易邮箱：

150****3279@163.com95555ad@message.cmbchina.com 、

13550347892@163.cmxjjxtrxy@szfudeli.com

王先生、8先生、蓝天、

白云啦@啦啦、

123@45612345678900、
13500000000 

拉拉省啊啊市某某街道88号

345874632181912

不应该的蒙层：台州经济开发区小郡肝串串香餐饮店 台州经济开发区会被蒙起来中华人民共和国

 会被蒙起来发票代码：033002100411

 代码会被蒙起来不应该的蒙层：台州经济开发区小郡肝串串香餐饮店 台州经济开发区会被蒙起来中华人民共和国 会被蒙起来这个跟产品核对过了处理成了地址合理

靳君瑞查看了

沈涛的手机号

靳君瑞查看了沈涛的手机号靳君瑞查看了沈涛的手机号

+86-18968106819​​​Shift + Enter 

换行银行卡号：622143637362712

营业执照

510030200123456124117004186056214

工商注册号

110000450007248

固话

881234900553-71234200553-7412343005537412340055397123420010747123401037412340010-7412340010-371234204006-8899-23

手机号1
3812346152 

+861381234615286
-138123461528613812346152341182199703081215

招商银行
152254533946214836123502607
- 李涯

53011219780130161X

中国建设银行

137691748506217003860010905220

-- 李涯

53011219780130161X

中国建设银行
137691748506217003860010905220
- 
李涯53011219780130161X

中国建设银行
137691748506217003860010905220
-- 李涯

53011219780130161X

中国建设银行
137691748506217003860010905220
-- 余文武
440233199508282055
中国工商银行

137197700716212263602118776830
-- 王雯

360602198510051048

中国建设银行
138700096736227002071110113372

 --黄江璐
362201198506230426

中国建设银行
134070553356227002100090207829
 -- 郑小闯

36253119891205205X

中国建设银行

138791610166217002020031698640

台胞证号码:
0099730503(B)
台胞证号码:
0099710503(B)
    `)};
  }
  return (
    <div style={styles.authority}>
      <div>
        12312
      </div>
      <Table columns={columns} dataSource={newdata} />
      <div style={{paddingBottom: '100px'}}>
      </div>
      <div dangerouslySetInnerHTML={createMarkup()} />
    </div>
  );
}

export default App;
